Tekla.Structures.ModelInternal.dotSingleRebar_t
Serialization structure for SingleRebar.

Tekla.Structures.ModelInternal.dotSingleRebar_t.Reinforcement
The base class for all reinforcements.

Tekla.Structures.ModelInternal.dotSingleRebar_t.StartHook
The hook at the beginning of the reinforcing bar.

Tekla.Structures.ModelInternal.dotSingleRebar_t.EndHook
The hook at the end of the reinforcing bar.

Tekla.Structures.ModelInternal.dotSingleRebar_t.Polygon
The polygon.